actuator/AC-DBD/flow/constant/forceDict
/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  7
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      forcesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

forceTimes
(
0
1.5e-05
2e-05
2.5e-05
3e-05
3.5e-05
4e-05
4.5e-05
5e-05
5.5e-05
6e-05
6.5e-05
7e-05
7.5e-05
8e-05
8.5e-05
9e-05
9.5e-05
0.0001
);

forceNames
(
Fc0
Fc1
Fc2
Fc3
Fc4
Fc5
Fc6
Fc7
Fc8
Fc9
Fc10
Fc11
Fc12
Fc13
Fc14
Fc15
Fc16
Fc17
);
